[
    [
        "Hennepin County Human Services ",
        "525 Portland Avenue South",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "Everyone has the right to apply for public assistance. Public assistance is available to persons who do not have the financial resources to pay for necessities such as food, housing, and medical care. There are different kinds of assistance, and each program has its own requirements and limits on income/assets. <h5>Types of Assistance</h5> <ul> <li> Minnesota Family Investment Program (MFIP) </li> <li> Diversionary Work Program (DWP) </li> <li> Emergency Assistance (EA) </li> <li> Energy Assistance </li> <li> Supplemental Nutrition Assistance Program (SNAP) </li> <li> General Assistance (GA) </li> <li> Medical Assistance (MA) </li> <li> Minnesota Supplemental Aid (MSA) </li> <li> Supplemental Security Income (SSI)<br> </li> </ul> <b>What you need: </b> An original picture ID, or a birth certificate, and your Social Security number. <b>For General Assistance </b> you must have a Social Security Card and one of the following: driver's license, state ID, passport or visa, alien registration card or certificate of naturalization, military photo ID or DD214, school ID, correctional facility photo ID (not from city jail or a mug shot), release/parole agreement (with confirming contact with facility or parole officer), operator's occupational license with photo, employee ID with photo, date of birth and signature, certified or original birth certificate, birth record certification card, notarized copy of a birth record from a Minnesota Indian reservation, or a Tribal Decree card.<br> <b>Note:</b> When applying always ask about other forms of assistance for which you are eligible. County workers will work with you to find all the programs that you qualify for.<br><br> <b>Your Rights:</b> <ul> <li> to apply or reapply at any time. </li> <li> to know the eligibility requirements </li> <li> to know how your grant was determined </li> <li> to choose where and with whom you live (with certain limitations) </li> <li> to appeal any decision or failure to act </li> <li> to file a complaint if discriminated against.<br> </li> </ul> <b>Your Responsibilities:</b> <ul> <li>to provide truthful information</li> <li>to inform the proper agency of changes such as address, income, persons living with you, and other factors which can affect your assistance. within 10 days of the change.</li> </ul> <b>Eligibility Supports Help Line: 612-596-1300</b><br> EZINFO Line is available with automated information at any time. To speak to a worker, the lines are open from 9:00 to 4:00 Monday through Friday. Please have your case number ready when you call. For information about EBT call 1-888-997-2227<br> <b>Appeals:</b><br> You have the right to appeal any decision made which affects benefits which you feel you are entitled to. You must appeal a decision within 30 days. If you receive a termination notice, however, you need to appeal within 10 days. If you want your grant to continue, you will need to request that in writing within 10 days or it will NOT continue. Any benefits received during an appeal will be considered an overpayment if you lose the appeal. You may want the advice of a lawyer. <h5>Where to Apply for Public Assistance Programs: </h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.",
        "",
        "",
        "",
        "ta",
        "368",
        "h",
        "Horray",
        "",
        "",
        "",
        "Again"
    ],
    [
        "MN Family Investment Program (mfip)",
        "525 Portland Avenue South",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "MFIP provides monthly assistance for men and women with children, pregnant women, and two-parent families who have little or no income. Applicants must meet eligibility requirements. (Parent(s) cannot have cash assets worth more than $10,000.<br> When applying, ask about other assistance you may qualify for such as Emergency Assistance (to prevent eviction, mortgage foreclosure and help pay utility bills), Energy Assistance (to help pay heat and electric bills), SNAP, & Medical Assistance.<br> You may apply online at: <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br> <h5>Where to Apply in Person:</h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> Also:<br> NorthPoint Health & Wellness Center<br> Gateway Program<br> 1315 Penn Avenue North<br> Phone: 612-767-9500<br> Hours: Monday and Friday 8 am-5 pm; Tuesday and Thursday 8 am-7 pm.<br> Provides: Gateway's goal is to increase family strength. This is done by connecting families to services and working closely to achieve family goals. Call for more information about assistance provided to MFIP families.",
        "",
        "",
        "",
        "mf",
        "369",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "Emergency Assistance (EA)",
        "525 Portland Avenue South",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "When families are in a financial crisis that poses a direct threat to the physical health or safety of a child younger than 18, the Emergency Assistance program can help by providing short-term aid. You must attend an interview to receive benefits.<br><br> Services include:<br><br> <ul> <li>Housing costs such as rent payments, damage deposits, home repairs, utility bills.</li> <li>Foreclosure prevention, moving expenses, transportation for homeless families.</li> <li>Additional food support for people who have specific dietary needs (special diets).</li> </ul> <br>Where to Apply in Person:<br> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.<br> <b> Emergency Assistance is limited to one use during a 12-month period. </b><br> Expedited Appeal<br> If your application for Emergency Assistance is denied, you may appeal the decision. If you request an expedited appeal, a hearing can be granted within a few days. You may want to consult with your Advocate; see also Legal Assistance.",
        "",
        "",
        "",
        "es",
        "370",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "Supplemental Nutrition Assistance Program (SNAP)",
        "",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "Monthly grants of SNAP can be used at grocery stores. The amount of the grant depends on the monthly income of each person in the family/household and costs for shelter. Most who receive assistance like MFIP, GA, or SSI are also eligible for SNAP. Working persons with low incomes may also qualify. Since eligibility is based on family or household income, you must provide truthful information about the income of all persons in your family/household. <h5>Where to Apply in Person:</h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South<br> You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.<br><br> <b>Single adults & Families:</b><br> <b>Salvation Army</b><br> Hours: Monday-Friday 8 am-noon and 1-4 pm<br> Remarks: Food support application assistance & info referral.<br><br> Temple: 1604 East Lake Street<br> Phone: 612-767-2700<br><br> Central: 2727 Central Avenue NE<br> Phone: 612-789-1512<br><br> Parkview: 2024 Lyndale Avenue North<br> Phone: 612-522-6581<br><br> Center City: 53 Glenwood Avenue<br> Phone: 612-659-0711<br><br> Second Harvest Heartland SNAP Application Assistance<br> Phone: 651-209-7963<br> Provides: Screening for SNAP eligibility and assistance completing application; follow-up as needed; assistance with recertification.<br><br> <b> Food Support Employment & Training </b><br> This is a job search program for individuals who receive food support. Participation is required to receive SNAP. <br> <br>",
        "",
        "",
        "",
        "sn",
        "371",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "General Assistance (GA)",
        "",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "General Assistance (GA) General Assistance provides monthly assistance to single persons and childless couples who have little or no income and who meet eligibility requirements. Families ineligible for MFIP are not eligible for GA. Applicants must meet eligibility requirements. <br><br> Examples: <br><br> (1) persons applying must be unable to work because of certified illness or injury, advanced age which makes it difficult to gain employment, inability to read and write well enough to hold employment, etc. (There are approximately 15 categories of eligibility; those mentioned above are among them.) People who were disqualified from SSI because they were categorized as 'DAA' (Drug & Alcohol Addicted) may be eligible for General Assistance. <br> <br> (2) persons cannot have cash assets worth more than $10,000. When applying, inquire about other assistance you may qualify for: Emergency General Assistance (to prevent eviction), Energy Assistance, SNAP and Medical Assistance. <br> <br> <h5>Where to Apply in Person:</h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.<br><br> note: Applicants for General Assistance can apply for other forms of assistance such as food support or health care programs at the same location.",
        "",
        "",
        "",
        "ga",
        "372",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "Medical Assistance (MA)",
        "",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "Provides assistance with payment of medical bills for persons and families who meet income eligibility requirements. Assets allowed vary, so be sure to bring your income information when you apply. Persons who are eligible have the right to see the doctor, dentist, pharmacy, clinic, or hospital of their choice. <h5>Where to Apply in Person:</h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> Where to Apply: You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.<br><br> note: Some copayments may be requred for office visits, prescriptions or other services for people on MA. <br><br> <h5>MNsure</h5> MNsure is the health insurance exchange where individuals and families select a health care plan, including low cost or free coverage. Insurance rules have changed even for Medical Assistance and MinnesotaCare. If you have not been able to get coverage in the past you may be qualify under the new rules. <br> <br>MNsure offers: <br><br> <ul> A website <a href=https://mnsure.org target=_blank>mnsure.org</a> where you can apply for coverage and select a health plan. <br><br> Someone you can talk to about your options over the phone, 1-855-3MNSURE (1-855-366-7873)<br><br> Places where you can sign up in your community. <br><br> Coverage starts Jan. 1 of the following year after open enrollment. Open enrollment ends in December, unless extended by DHS. Enrollment in Medical Assistance or MinnesotaCare continues throughout the year. </ul> <br>",
        "",
        "",
        "",
        "ma",
        "373",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "Minnesota Supplemental Aid (MSA) ",
        "",
        "612-596-1300",
        "M-F 8 am-4:30 pm",
        "Minnesota Supplemental Aid (MSA) <br> A state-sponsored program that provides additional monthly funding to those persons who are receiving SSI or Social Security. The amount of an MSA grant depends on several different factors, such as how much you pay in rent, if you live alone or with other people, and what your total income is. (Income includes Social Security and SSI.) Because it is a state program, the county-not the Social Security office manages it. <br> <h5>Where to Apply in Person:</h5> <h5>Hennepin County Human Services Dept. Locations:</h5> Phone: 612-596-1300<br> Hours: Monday-Friday 8 am-4:30 pm.<br><br> South Minneapolis Human Service Center<br> 2215 East Lake Street<br><br> Central-Northeast Minneapolis Human Service Center<br> 525 Portland Avenue South<br><br> North Minneapolis Human Service Center<br> 1001 Plymouth Avenue North<br><br> West Suburban Human Service Center<br> 1011 1st Street South, Suite 108, Hopkins<br><br> South Suburban Human Service Center<br> VEAP Community Service Ctr (Open until 6:30 pm Thurs.)<br> 9600 Aldrich Avenue South, Bloomington<br><br> Northwest Suburban Family Service Center<br> 7051 Brooklyn Blvd., Brooklyn Center<br><br> <You may apply online at: <br> <a href=https://applymn.dhs.mn.gov/online-appweb/spring/public/process-login?execution=e1s1 target=_blank>Online Assistance Application</a><br><br> You may also call to have the application packet mailed directly to you.<br>",
        "",
        "",
        "",
        "mp",
        "374",
        "h",
        "525 Portland Avenue South",
        "",
        "",
        "",
        "www.hennepin.us/"
    ],
    [
        "Social Security",
        "1811 Chicago Avenue South",
        "1-800-772-1213",
        "M-F 9 am-4:30 pm",
        "Where to Apply:<br> Social Security Administration<br> 1811 Chicago Avenue South<br> Phone: 1-800-772-1213<br> Hours: Monday through Friday from 9 am-4:30 pm.<br> </ul> Supplemental Security Income (SSI)<br><br> SSI is a federal needs based program providing benefits to anyone who is aged (age 65 or older), blind, or disabled. Disabled under SSI rules means a person has a medically determinable physical or mental impairment, which: results in the inability to do any substantial gainful activity, and has lasted or can be expected to last for a continuous period of not less than 12 months. Substantial gainful activity is defined as the ability to work and earn $1,130 per month. If someone is working, there are ways that could lower the monthly gross wages below $1,130. The Social Security Administration no longer recognizes drug addiction and alcoholism (DA & A) as disabling conditions. Someone with another impairment should still file. If the DA & A does not contribute to the impairment, they could be found to be disabled. Anyone who is disabled, should be encouraged to file for benefits.<br><br>    To determine SSI eligibility and payment amounts, SSA considers the applicant's income and resources. Income could include money earned from work, benefits from other sources, such as; Social Security, worker's compensation, Veterans Affairs, friends or relatives, free food or shelter. Resources are things which a person owns such as; cash, bank accounts, land, vehicles, personal property, life insurance, anything that can be converted to cash and used for food and shelter. There are many exceptions/exclusions regarding income and resources. Anyone that is disabled should be encouraged to file for SSI.<br><br> To be eligible for SSI, an applicant must be a US citizen or one of certain alien categories. There are many categories of lawful aliens that would be eligible for SSI, contact a Social Security Office or the National 800 number 1-800-772-1213 to inquire.<br> <br> Anyone applying for SSI will be asked about their medical history; doctors, tests, and medications. The claim representative (CR) will ask questions about the person's income, resources, and living arrangements. The CR will ask the applicant to attest to the truthfulness of their answers.<br><br> <b>Appeals:</b><br><br> If an application is denied, there is a 65 day appeals period (60 days plus 5 days mailing). If an appeal is requested after 65 days, the applicant must show good cause for late filing of the appeal. If the late appeal is not accepted, a new application can be filed, but there is a potential loss of benefits. The Social Security Office can provide a referral list for free legal services. <br><br> Cooper Law Firm<br> 825 Nicollet Mall, Suite 950, Minneapolis (Medical Arts Bldg.)<br> Phone: 612-353-4769<br> Hours: Call for an appointment. Appointments available at shelters, various locations throughout the Twin Cities, and at their office.<br> Provides: Free attorney assistance filing Social Security applications, reconsiderations and appeals for recipients of GA, MFIP, DWP, and FSS. Sliding fee available for those not on public assistance.<br><br> Salvation Army Center City Office<br> 53 Glenwood Avenue<br> Phone: 612-659-0711 ext. 30<br> Service Area: Minneapolis and West Metro area<br> Provides: If you are unable to work because of a diagnosed disability, staff will assist with applications for Social Security benefits for individuals who are receiving cash assistance from the county (GA, MFIP, RCA).<br>",
        "",
        "",
        "",
        "ss",
        "375",
        "h",
        "1811 Chicago Avenue South",
        "",
        "",
        "",
        "www.ssa.gov"
    ]
]
